---
type: ThermalProperties
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# ThermalProperties

`Autodesk.Revit.DB.ThermalProperties` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Absorptance | 2013 | `public double Absorptance { get ; set ; }` |
| Property | HeatTransferCoefficient | 2013 | `public double HeatTransferCoefficient { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Roughness | 2013 | `public int Roughness { get ; set ; }` |
| Property | ThermalMass | 2013 | `public double ThermalMass { get ; }` |
| Property | ThermalResistance | 2013 | `public double ThermalResistance { get ; }` |